Using TensorFlow backend.
Found 7819 images belonging to 5 classes.
Found 866 images belonging to 5 classes.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
zero_padding2d_1 (ZeroPaddin (None, 102, 102, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 100, 100, 64)      1792      
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 102, 102, 64)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 100, 100, 64)      36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 50, 50, 64)        0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 52, 52, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 50, 50, 128)       73856     
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 52, 52, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 50, 50, 128)       147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 25, 25, 128)       0         
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 27, 27, 128)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 25, 25, 256)       295168    
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 27, 27, 256)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 25, 25, 256)       590080    
_________________________________________________________________
zero_padding2d_7 (ZeroPaddin (None, 27, 27, 256)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 25, 25, 256)       590080    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 12, 12, 256)       0         
_________________________________________________________________
zero_padding2d_8 (ZeroPaddin (None, 14, 14, 256)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 12, 12, 512)       1180160   
_________________________________________________________________
zero_padding2d_9 (ZeroPaddin (None, 14, 14, 512)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 12, 12, 512)       2359808   
_________________________________________________________________
zero_padding2d_10 (ZeroPaddi (None, 14, 14, 512)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 12, 12, 512)       2359808   
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 6, 6, 512)         0         
_________________________________________________________________
zero_padding2d_11 (ZeroPaddi (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 6, 6, 512)         2359808   
_________________________________________________________________
zero_padding2d_12 (ZeroPaddi (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 6, 6, 512)         2359808   
_________________________________________________________________
zero_padding2d_13 (ZeroPaddi (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 6, 6, 512)         2359808   
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 3, 3, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              18878464  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 20485     
=================================================================
Total params: 50,394,949
Trainable params: 50,394,949
Non-trainable params: 0
_________________________________________________________________
Epoch 1/30
129/245 [==============>...............] - ETA: 28s - loss: 1.5867 - acc: 0.2771  C:\Users\Rub3z\Anaconda3\envs\vggnet\lib\site-packages\PIL\Image.py:953: UserWarning: Palette images with Transparency   expressed in bytes should be converted to RGBA images
  'to RGBA images')
141/245 [================>.............] - ETA: 25s - loss: 1.5840 - acc: 0.2819C:\Users\Rub3z\Anaconda3\envs\vggnet\lib\site-packages\PIL\TiffImagePlugin.py:754: UserWarning: Possibly corrupt EXIF data.  Expecting to read 6029312 bytes but only got 0. Skipping tag 0
  " Skipping tag %s" % (size, len(data), tag))
C:\Users\Rub3z\Anaconda3\envs\vggnet\lib\site-packages\PIL\TiffImagePlugin.py:754: UserWarning: Possibly corrupt EXIF data.  Expecting to read 1311848 bytes but only got 785. Skipping tag 0
  " Skipping tag %s" % (size, len(data), tag))
C:\Users\Rub3z\Anaconda3\envs\vggnet\lib\site-packages\PIL\TiffImagePlugin.py:771: UserWarning: Corrupt EXIF data.  Expecting to read 12 bytes but only got 8. 
  warnings.warn(str(msg))
245/245 [==============================] - 57s 232ms/step - loss: 1.5731 - acc: 0.2849 - val_loss: 1.5394 - val_acc: 0.2656
Epoch 2/30
245/245 [==============================] - 46s 188ms/step - loss: 1.5311 - acc: 0.3395 - val_loss: 1.4860 - val_acc: 0.3891
Epoch 3/30
245/245 [==============================] - 45s 184ms/step - loss: 1.3223 - acc: 0.4523 - val_loss: 1.1832 - val_acc: 0.5634
Epoch 4/30
245/245 [==============================] - 46s 188ms/step - loss: 1.1672 - acc: 0.5204 - val_loss: 0.9990 - val_acc: 0.5808
Epoch 5/30
245/245 [==============================] - 47s 193ms/step - loss: 1.0110 - acc: 0.5919 - val_loss: 0.9195 - val_acc: 0.6100
Epoch 6/30
245/245 [==============================] - 45s 182ms/step - loss: 0.9668 - acc: 0.6160 - val_loss: 0.9099 - val_acc: 0.6339
Epoch 7/30
245/245 [==============================] - 49s 199ms/step - loss: 0.9266 - acc: 0.6329 - val_loss: 0.8243 - val_acc: 0.6651
Epoch 8/30
245/245 [==============================] - 46s 188ms/step - loss: 0.8999 - acc: 0.6450 - val_loss: 0.8082 - val_acc: 0.7171
Epoch 9/30
245/245 [==============================] - 48s 194ms/step - loss: 0.8458 - acc: 0.6832 - val_loss: 0.9040 - val_acc: 0.6547
Epoch 10/30
245/245 [==============================] - 45s 183ms/step - loss: 0.8266 - acc: 0.6953 - val_loss: 0.7258 - val_acc: 0.7608
Epoch 11/30
245/245 [==============================] - 46s 186ms/step - loss: 0.7744 - acc: 0.7164 - val_loss: 0.7116 - val_acc: 0.7413
Epoch 12/30
245/245 [==============================] - 46s 187ms/step - loss: 0.7533 - acc: 0.7307 - val_loss: 0.7007 - val_acc: 0.7500
Epoch 13/30
245/245 [==============================] - 46s 187ms/step - loss: 0.7292 - acc: 0.7364 - val_loss: 0.6930 - val_acc: 0.7517
Epoch 14/30
245/245 [==============================] - 48s 197ms/step - loss: 0.7042 - acc: 0.7547 - val_loss: 0.6732 - val_acc: 0.7380
Epoch 15/30
245/245 [==============================] - 46s 189ms/step - loss: 0.6821 - acc: 0.7578 - val_loss: 0.6686 - val_acc: 0.7633
Epoch 16/30
245/245 [==============================] - 46s 189ms/step - loss: 0.6754 - acc: 0.7598 - val_loss: 0.6751 - val_acc: 0.7471
Epoch 17/30
245/245 [==============================] - 47s 192ms/step - loss: 0.6631 - acc: 0.7571 - val_loss: 0.6811 - val_acc: 0.7524
Epoch 18/30
245/245 [==============================] - 47s 192ms/step - loss: 0.6402 - acc: 0.7724 - val_loss: 0.6535 - val_acc: 0.7787
Epoch 19/30
245/245 [==============================] - 46s 187ms/step - loss: 0.6399 - acc: 0.7692 - val_loss: 0.6704 - val_acc: 0.7667
Epoch 20/30
245/245 [==============================] - 46s 189ms/step - loss: 0.6209 - acc: 0.7762 - val_loss: 0.5991 - val_acc: 0.7864
Epoch 21/30
245/245 [==============================] - 46s 187ms/step - loss: 0.6079 - acc: 0.7898 - val_loss: 0.5865 - val_acc: 0.7775
Epoch 22/30
245/245 [==============================] - 46s 189ms/step - loss: 0.6079 - acc: 0.7815 - val_loss: 0.6073 - val_acc: 0.7945
Epoch 23/30
245/245 [==============================] - 46s 189ms/step - loss: 0.5783 - acc: 0.7952 - val_loss: 0.5767 - val_acc: 0.7907
Epoch 24/30
245/245 [==============================] - 46s 187ms/step - loss: 0.5687 - acc: 0.7985 - val_loss: 0.6380 - val_acc: 0.7783
Epoch 25/30
245/245 [==============================] - 46s 189ms/step - loss: 0.5662 - acc: 0.7960 - val_loss: 0.6109 - val_acc: 0.7771
Epoch 26/30
245/245 [==============================] - 46s 188ms/step - loss: 0.5744 - acc: 0.7968 - val_loss: 0.5639 - val_acc: 0.8026
Epoch 27/30
245/245 [==============================] - 46s 189ms/step - loss: 0.5536 - acc: 0.8010 - val_loss: 0.6076 - val_acc: 0.7737
Epoch 28/30
245/245 [==============================] - 46s 189ms/step - loss: 0.5532 - acc: 0.8017 - val_loss: 0.5396 - val_acc: 0.8098
Epoch 29/30
245/245 [==============================] - 48s 194ms/step - loss: 0.5542 - acc: 0.7982 - val_loss: 0.5899 - val_acc: 0.7823
Epoch 30/30
245/245 [==============================] - 46s 188ms/step - loss: 0.5356 - acc: 0.8101 - val_loss: 0.6316 - val_acc: 0.7644
Exception ignored in: <generator object generatorChecker at 0x00000273047AFEB8>
RuntimeError: generator ignored GeneratorExit
Exception ignored in: <generator object generatorChecker at 0x00000273047AFF68>
RuntimeError: generator ignored GeneratorExit